### pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language

### Pandas - Panel Data

### Datatypes in Pandas

### Series

Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. 


### Dataframe
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.


### Panel
A panel is a 3D container of data



#### To install
pip install pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8,8])  #here we are creating a Series using a list

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
6    8.0
dtype: float64

In [4]:
type(s)

pandas.core.series.Series

In [5]:
s.shape  #shape will show the shape(#rows and # columns) - For series #columns will be always 1.

(7,)

In [6]:
s.head(3) #head used to display the first n number of observations default n = 5

0    1.0
1    3.0
2    5.0
dtype: float64

In [7]:
s.tail(3) #tail used to display the last n number of observations default n = 5

4    6.0
5    8.0
6    8.0
dtype: float64

In [8]:
s.dtypes #dtypes used to identify the datatype of the series/dataframe

dtype('float64')

In [9]:
s1 = pd.Series([1, 3, 5, 7, 6, 8])

In [10]:
s1.dtypes

dtype('int64')

In [11]:
s.add(1)

0    2.0
1    4.0
2    6.0
3    NaN
4    7.0
5    9.0
6    9.0
dtype: float64

In [12]:
s.subtract(1)

0    0.0
1    2.0
2    4.0
3    NaN
4    5.0
5    7.0
6    7.0
dtype: float64

In [13]:
s.multiply(5)

0     5.0
1    15.0
2    25.0
3     NaN
4    30.0
5    40.0
6    40.0
dtype: float64

In [14]:
s.divide(5)

0    0.2
1    0.6
2    1.0
3    NaN
4    1.2
5    1.6
6    1.6
dtype: float64

In [15]:
s.mean()

5.166666666666667

In [16]:
s.median()

5.5

In [17]:
s.mode()[0]

8.0

In [18]:
arr = np.arange(10,20,2)

In [19]:
s2 = pd.Series(arr)  #creating a Series from numpy array

In [20]:
s2

0    10
1    12
2    14
3    16
4    18
dtype: int32

In [21]:
s2.dtypes

dtype('int32')

### DataFrame

In [22]:
df = pd.read_csv("data/supermarket_sales.csv")  #read_csv is used to read a csv file and create a DataFrame

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
df.shape

(1000, 17)

In [25]:
df.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,01-05-2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.22,03-08-2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,03-03-2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.048,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,02-08-2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [26]:
df.tail(10)

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
990,886-18-2897,A,Yangon,Normal,Female,Food and beverages,56.56,5,14.1400,296.94,3/22/2019,19:06,Credit card,282.80,4.761905,14.1400,4.5
991,602-16-6955,B,Mandalay,Normal,Female,Sports and travel,76.60,10,38.3000,804.3,1/24/2019,18:10,Ewallet,766.00,4.761905,38.3000,6.0
992,745-74-0715,A,Yangon,Normal,Male,Electronic accessories,58.03,2,5.8030,121.863,03-10-2019,20:46,Ewallet,116.06,4.761905,5.8030,8.8
993,690-01-6631,B,Mandalay,Normal,Male,Fashion accessories,17.49,10,8.7450,183.645,2/22/2019,18:35,Ewallet,174.90,4.761905,8.7450,6.6
994,652-49-6720,C,Naypyitaw,Member,Female,Electronic accessories,60.95,1,3.0475,63.9975,2/18/2019,11:40,Ewallet,60.95,4.761905,3.0475,5.9
995,233-67-5758,C,Naypyitaw,Normal,Male,Health and beauty,40.35,1,2.0175,42.3675,1/29/2019,13:46,Ewallet,40.35,4.761905,2.0175,6.2
996,303-96-2227,B,Mandalay,Normal,Female,Home and lifestyle,97.38,10,48.6900,1022.49,03-02-2019,17:16,Ewallet,973.80,4.761905,48.6900,4.4
997,727-02-1313,A,Yangon,Member,Male,Food and beverages,31.84,1,1.5920,33.432,02-09-2019,13:22,Cash,31.84,4.761905,1.5920,7.7
998,347-56-2442,A,Yangon,Normal,Male,Home and lifestyle,65.82,1,3.2910,69.111,2/22/2019,15:33,Cash,65.82,4.761905,3.2910,4.1
999,849-09-3807,A,Yangon,Member,Female,Fashion accessories,88.34,7,30.9190,649.299,2/18/2019,13:28,Cash,618.38,4.761905,30.9190,6.6

In [27]:
df.columns #columns will display all the column names

Index(['Invoice ID', 'Branch', 'City', 'Customer type', 'Gender',
       'Product line', 'Unit price', 'Quantity', 'Tax 5%', 'Total', 'Date',
       'Time', 'Payment', 'cogs', 'gross margin percentage', 'gross income',
       'Rating'],
      dtype='object')

In [28]:
df.index #index will display the index of rows

RangeIndex(start=0, stop=1000, step=1)

In [29]:
df.dtypes

Invoice ID                  object
Branch                      object
City                        object
Customer type               object
Gender                      object
Product line                object
Unit price                 float64
Quantity                     int64
Tax 5%                     float64
Total                       object
Date                        object
Time                        object
Payment                     object
cogs                       float64
gross margin percentage    float64
gross income               float64
Rating                     float64
dtype: object

In [30]:
df.size

17000

In [31]:
df.shape[0]*df.shape[1]

17000

In [32]:
df.describe() #describe function will give us the summary of dataframe (only numerical features)

,Unit price,Quantity,Tax 5%,cogs,gross margin percentage,gross income,Rating
count,1000.000000,1000.000000,1000.000000,1000.00000,1.000000e+03,1000.000000,1000.00000
mean,55.672130,5.510000,15.379369,307.58738,4.761905e+00,15.379369,6.97270
std,26.494628,2.923431,11.708825,234.17651,6.220360e-14,11.708825,1.71858
min,10.080000,1.000000,0.508500,10.17000,4.761905e+00,0.508500,4.00000
25%,32.875000,3.000000,5.924875,118.49750,4.761905e+00,5.924875,5.50000
50%,55.230000,5.000000,12.088000,241.76000,4.761905e+00,12.088000,7.00000
75%,77.935000,8.000000,22.445250,448.90500,4.761905e+00,22.445250,8.50000
max,99.960000,10.000000,49.650000,993.00000,4.761905e+00,49.650000,10.00000

In [33]:
df.describe(include='O') #Summary of Object columns

,Invoice ID,Branch,City,Customer type,Gender,Product line,Total,Date,Time,Payment
count,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000
unique,1000,3,3,2,2,6,990,89,506,3
top,291-55-6563,A,Yangon,Member,Female,Fashion accessories,93.744,02-07-2019,14:42,Ewallet
freq,1,340,340,501,501,178,2,20,7,345

In [34]:
df.describe(include='all')  #display description for every features

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
count,1000,1000,1000,1000,1000,1000,1000.000000,1000.000000,1000.000000,1000,1000,1000,1000,1000.00000,1.000000e+03,1000.000000,1000.00000
unique,1000,3,3,2,2,6,NaN,NaN,NaN,990,89,506,3,NaN,NaN,NaN,NaN
top,291-55-6563,A,Yangon,Member,Female,Fashion accessories,NaN,NaN,NaN,93.744,02-07-2019,14:42,Ewallet,NaN,NaN,NaN,NaN
freq,1,340,340,501,501,178,NaN,NaN,NaN,2,20,7,345,NaN,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,55.672130,5.510000,15.379369,NaN,NaN,NaN,NaN,307.58738,4.761905e+00,15.379369,6.97270
std,NaN,NaN,NaN,NaN,NaN,NaN,26.494628,2.923431,11.708825,NaN,NaN,NaN,NaN,234.17651,6.220360e-14,11.708825,1.71858
min,NaN,NaN,NaN,NaN,NaN,NaN,10.080000,1.000000,0.508500,NaN,NaN,NaN,NaN,10.17000,4.761905e+00,0.508500,4.00000
25%,NaN,NaN,NaN,NaN,NaN,NaN,32.875000,3.000000,5.924875,NaN,NaN,NaN,NaN,118.49750,4.761905e+00,5.924875,5.50000
50%,NaN,NaN,NaN,NaN,NaN,NaN,55.230000,5.000000,12.088000,NaN,NaN,NaN,NaN,241.76000,4.761905e+00,12.088000,7.00000
75%,NaN,NaN,NaN,NaN,NaN,NaN,77.935000,8.000000,22.445250,NaN,NaN,NaN,NaN,448.90500,4.761905e+00,22.445250,8.50000
max,NaN,NaN,NaN,NaN,NaN,NaN,99.960000,10.000000,49.650000,NaN,NaN,NaN,NaN,993.00000,4.761905e+00,49.650000,10.00000

In [35]:
#checking for the missing value information 
df.isna().sum() #is not available function

#There are no missing value in the present data set

Invoice ID                 0
Branch                     0
City                       0
Customer type              0
Gender                     0
Product line               0
Unit price                 0
Quantity                   0
Tax 5%                     0
Total                      0
Date                       0
Time                       0
Payment                    0
cogs                       0
gross margin percentage    0
gross income               0
Rating                     0
dtype: int64

In [36]:
data_new = pd.read_csv("data/abcd.csv")
data_new.isna().sum()

Invoice ID                 2
Branch                     2
City                       2
Customer type              1
Gender                     1
Product line               0
Unit price                 2
Quantity                   0
Tax 5%                     0
Total                      0
Date                       1
Time                       1
Payment                    0
cogs                       0
gross margin percentage    0
gross income               0
Rating                     0
dtype: int64

In [37]:
data_new.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,NaN,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,01-05-2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,NaN,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.22,03-08-2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,NaN,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,03-03-2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,NaN,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.048,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,NaN,Normal,Male,Sports and travel,NaN,7,30.2085,634.3785,02-08-2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

### Creating DataFrame

In [38]:
#1 Loading existing data
#2 create a DataFrame Programatically

df = pd.DataFrame([["A",20],["B",21],["C",22],["D",23],['E',24]],columns=['Name','Age'])

In [39]:
df.shape

(5, 2)

In [40]:
df['Gender'] = ['M','M','F','F','F']

In [41]:
df['Gender'] = ['F','F','F','F','F'] #datafrmes are mutable

In [42]:
df

  Name  Age Gender
0    A   20      F
1    B   21      F
2    C   22      F
3    D   23      F
4    E   24      F

In [43]:
df.shape

(5, 3)

In [44]:
df.tail()

  Name  Age Gender
0    A   20      F
1    B   21      F
2    C   22      F
3    D   23      F
4    E   24      F

In [45]:
df.head()

  Name  Age Gender
0    A   20      F
1    B   21      F
2    C   22      F
3    D   23      F
4    E   24      F

In [46]:
df.describe()

             Age
count   5.000000
mean   22.000000
std     1.581139
min    20.000000
25%    21.000000
50%    22.000000
75%    23.000000
max    24.000000

In [47]:
df

  Name  Age Gender
0    A   20      F
1    B   21      F
2    C   22      F
3    D   23      F
4    E   24      F

### Access Data from DataFrame

In [48]:
#to access a column
df['Name']

0    A
1    B
2    C
3    D
4    E
Name: Name, dtype: object

In [49]:
df[['Name','Gender']] #selecting multiple columns - passning column names as a list

  Name Gender
0    A      F
1    B      F
2    C      F
3    D      F
4    E      F

In [50]:
#to acess row we need to specify the row index.
#loc means location -we are specifying the location by index.

df.loc[0]

Name       A
Age       20
Gender     F
Name: 0, dtype: object

In [51]:
df.loc[0:2]

  Name  Age Gender
0    A   20      F
1    B   21      F
2    C   22      F

In [52]:
df.index = df['Name']

In [53]:
df

     Name  Age Gender
Name
A       A   20      F
B       B   21      F
C       C   22      F
D       D   23      F
E       E   24      F

In [54]:
df.loc['A']

Name       A
Age       20
Gender     F
Name: A, dtype: object

In [55]:
df.loc[['A','B','C']] #in loc function we are providing the actual index.

     Name  Age Gender
Name
A       A   20      F
B       B   21      F
C       C   22      F

In [56]:
df

     Name  Age Gender
Name
A       A   20      F
B       B   21      F
C       C   22      F
D       D   23      F
E       E   24      F

In [57]:
#iloc function accept range index. ie (0,1,2,...)

df.iloc[0]

Name       A
Age       20
Gender     F
Name: A, dtype: object

In [58]:
df.iloc[3]

Name       D
Age       23
Gender     F
Name: D, dtype: object

In [59]:
df.iloc[[0,1,2]]

     Name  Age Gender
Name
A       A   20      F
B       B   21      F
C       C   22      F

In [60]:
df

     Name  Age Gender
Name
A       A   20      F
B       B   21      F
C       C   22      F
D       D   23      F
E       E   24      F

In [61]:
df.loc['A','Age']

20

In [62]:
df.iloc[0,1]

20

In [63]:
#To access a cell using loc

df.loc['A','Age'] = 50

In [64]:
df

     Name  Age Gender
Name
A       A   50      F
B       B   21      F
C       C   22      F
D       D   23      F
E       E   24      F

In [65]:
df.iloc[0,1]=35

In [66]:
df

     Name  Age Gender
Name
A       A   35      F
B       B   21      F
C       C   22      F
D       D   23      F
E       E   24      F

In [67]:
df.iloc[: , :-1]

     Name  Age
Name
A       A   35
B       B   21
C       C   22
D       D   23
E       E   24

In [68]:
df.iloc[ : , 1]

Name
A    35
B    21
C    22
D    23
E    24
Name: Age, dtype: int64

In [69]:
df.iloc[ : , [0,1,2]]

     Name  Age Gender
Name
A       A   35      F
B       B   21      F
C       C   22      F
D       D   23      F
E       E   24      F

In [70]:
#duplicate index
#1 Loading existing data
#2 create a DataFrame Programatically

df1 = pd.DataFrame([["A",20],["B",21],["C",22],["D",23],['A',24]],columns=['Name','Age'])

In [71]:
df1

  Name  Age
0    A   20
1    B   21
2    C   22
3    D   23
4    A   24

In [72]:
df1.index = df1['Name']

In [73]:
df1.loc['A']

     Name  Age
Name
A       A   20
A       A   24

### Delete rows and columns from DataFrame

In [74]:
df

     Name  Age Gender
Name
A       A   35      F
B       B   21      F
C       C   22      F
D       D   23      F
E       E   24      F

In [75]:
#for deleting rows and columns we use function called 'drop'

#we have to specify the axis 
#Axis=0 for rows
#Axis=1 for columns

df = df.drop('A') #default value for axis is 0.

In [76]:
df

     Name  Age Gender
Name
B       B   21      F
C       C   22      F
D       D   23      F
E       E   24      F

In [77]:
df = df.drop('Gender',axis=1)

In [78]:
df

     Name  Age
Name
B       B   21
C       C   22
D       D   23
E       E   24

In [79]:
del df['Age'] #del command is an alternative to delete columns

In [80]:
df

     Name
Name
B       B
C       C
D       D
E       E

In [81]:
df.drop(['B','E'])

     Name
Name
C       C
D       D

In [82]:
data = pd.read_csv("data/supermarket_sales.csv")

In [83]:
data.dtypes

Invoice ID                  object
Branch                      object
City                        object
Customer type               object
Gender                      object
Product line                object
Unit price                 float64
Quantity                     int64
Tax 5%                     float64
Total                       object
Date                        object
Time                        object
Payment                     object
cogs                       float64
gross margin percentage    float64
gross income               float64
Rating                     float64
dtype: object

In [84]:
data.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,01-05-2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.22,03-08-2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,03-03-2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.048,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,02-08-2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [85]:
#to calculate the mean
avg = data["gross income"].mean()
avg

15.379369000000002

In [86]:
#to calculate the median
median = data['gross income'].median()
median

12.088

In [87]:
# to calculate the mode
modes = data['Gender'].mode()
modes

0    Female
dtype: object

In [88]:
modeseries = pd.Series([1,1,1,2,2,2,2])
modeseries.mode()

0    2
dtype: int64

In [89]:
#standard deviation
data['gross income'].std()

11.708825480998659

In [90]:
data.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,01-05-2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.22,03-08-2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,03-03-2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.048,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,02-08-2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

### Practice Questions

1.What is the total gross income

2.which is the most commonly used payment type

3.what is the average unit price of the products

4.what is the total number of sales(unique number of invoice id)?

5.what is average gross income per sales

6.what is the standard deviation of product unit price

7.What are the different types of Product Line

8.How many customer classes are there

In [91]:
#Total gross income
total_income = data['gross income'].sum()
print("Total Gross Income: ",total_income)

Total Gross Income:  15379.368999999999

In [92]:
# which is the most commonly used payment type
payment_type = data['Payment'].mode()[0]
print('Most commonly used payment type:',payment_type)

Most commonly used payment type: Ewallet

In [93]:
# what is the average unit price of the products
average_up = data['Unit price'].mean()
print('Average Unit Price of Products : ',average_up)

Average Unit Price of Products :  55.67212999999998

In [94]:
# what is the total number of sales(unique number of invoice id)

sales = data.shape[0]
print("Total number of sales: ",sales)

Total number of sales:  1000

In [95]:
#what is average gross income per sales
average_income = data['gross income'].mean()
print('Average Gross Income:',average_income)

Average Gross Income: 15.379369000000002

In [96]:
#what is the standard deviation of product unit price
std = data['Unit price'].std()
print('Standard Deviation of Unit Price:',std)

Standard Deviation of Unit Price: 26.494628347919768

In [97]:
#what is the total number of sales(unique number of invoice id)?
sales = data.describe(include='O').loc['unique','Invoice ID']
print("Total number of sales: ",sales)

Total number of sales:  1000

In [99]:
#unique and nunique


# What are the different types of Product Line

data['Product line'].unique()

array(['Health and beauty', 'Electronic accessories',
       'Home and lifestyle', 'Sports and travel', 'Food and beverages',
       'Fashion accessories'], dtype=object)

In [101]:
#How many customer classes are there

data['Customer type'].nunique()

2

In [98]:
#END